In [1]:
import pandas as pd

In [9]:
df = pd.read_csv("./email.csv")

In [11]:
df

  Login email;Identifier;First name;Last name
0           laura@example.com;2070;Laura;Grey
1        craig@example.com;4081;Craig;Johnson
2          mary@example.com;9346;Mary;Jenkins
3          jamie@example.com;5079;Jamie;Smith

In [19]:
print(df.to_string())

  Login email;Identifier;First name;Last name
0           laura@example.com;2070;Laura;Grey
1        craig@example.com;4081;Craig;Johnson
2          mary@example.com;9346;Mary;Jenkins
3          jamie@example.com;5079;Jamie;Smith

In [24]:
df.head() # first five rows

  Login email;Identifier;First name;Last name
0           laura@example.com;2070;Laura;Grey
1        craig@example.com;4081;Craig;Johnson
2          mary@example.com;9346;Mary;Jenkins
3          jamie@example.com;5079;Jamie;Smith

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column                                       Non-Null Count  Dtype
---  ------                                       --------------  -----
 0   Login email;Identifier;First name;Last name  4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

In [30]:
df.describe()

       Login email;Identifier;First name;Last name
count                                            4
unique                                           4
top              laura@example.com;2070;Laura;Grey
freq                                             1

In [32]:
df.columns

Index(['Login email;Identifier;First name;Last name'], dtype='object')

In [36]:
df.shape

(4, 1)